// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций


&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл Excel";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.Фильтр = НСтр("ru='json';en='json'") + "(*.json)|*.json";
	
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Диалог.ПолноеИмяФайла= ПутьКФайлу;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		ВыбранныйФайл = Диалог.ПолноеИмяФайла;
		ПутьКФайлу = ВыбранныйФайл;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

&НаСервере
Процедура ЗаписатьНаСервере()
		
	МассивОбъектов = Новый Массив; // Массив из Строка
	МассивОбъектов.Добавить("WebСервисы");
	МассивОбъектов.Добавить("WSСсылки");
	МассивОбъектов.Добавить("БизнесПроцессы");
	МассивОбъектов.Добавить("Документы");
	МассивОбъектов.Добавить("ДополнительныеСловариПолнотекстовогоПоиска");
	МассивОбъектов.Добавить("ЖурналыДокументов");
	МассивОбъектов.Добавить("Задачи");
	МассивОбъектов.Добавить("Интерфейсы");
	МассивОбъектов.Добавить("Константы");
	МассивОбъектов.Добавить("КраткаяИнформация");
	МассивОбъектов.Добавить("КритерииОтбора");
	МассивОбъектов.Добавить("МодульВнешнегоСоединения");
	МассивОбъектов.Добавить("МодульПриложения");
	МассивОбъектов.Добавить("МодульСеанса");
	МассивОбъектов.Добавить("НумераторыДокументов");
	МассивОбъектов.Добавить("Обработки");
	МассивОбъектов.Добавить("ОбщиеКартинки");
	МассивОбъектов.Добавить("ОбщиеМакеты");
	МассивОбъектов.Добавить("ОбщиеМодули");
	МассивОбъектов.Добавить("ОбщиеФормы");
	МассивОбъектов.Добавить("ОсновнаяФормаКонстант");
	МассивОбъектов.Добавить("ОсновнойИнтерфейс");
	МассивОбъектов.Добавить("ОсновнойСтиль");
	МассивОбъектов.Добавить("ОсновнойЯзык");
	МассивОбъектов.Добавить("Отчеты");
	МассивОбъектов.Добавить("ПакетыXDTO");
	МассивОбъектов.Добавить("ПараметрыСеанса");
	МассивОбъектов.Добавить("Перечисления");
	МассивОбъектов.Добавить("ПланыВидовРасчета");
	МассивОбъектов.Добавить("ПланыВидовХарактеристик");
	МассивОбъектов.Добавить("ПланыОбмена");
	МассивОбъектов.Добавить("ПланыСчетов");
	МассивОбъектов.Добавить("ПодпискиНаСобытия");
	МассивОбъектов.Добавить("ПодробнаяИнформация");
	МассивОбъектов.Добавить("Подсистемы");
	МассивОбъектов.Добавить("Последовательности");
	МассивОбъектов.Добавить("Поставщик");
	МассивОбъектов.Добавить("РегистрыБухгалтерии");
	МассивОбъектов.Добавить("РегистрыНакопления");
	МассивОбъектов.Добавить("РегистрыРасчета");
	МассивОбъектов.Добавить("РегистрыСведений");
	МассивОбъектов.Добавить("РегламентныеЗадания");
	МассивОбъектов.Добавить("РежимАвтонумерацииОбъектов");
	МассивОбъектов.Добавить("РежимУправленияБлокировкойДанных");
	МассивОбъектов.Добавить("РодительскиеКонфигурации");
	МассивОбъектов.Добавить("Роли");
	МассивОбъектов.Добавить("СвойстваОбъектов");
	МассивОбъектов.Добавить("Синоним");
	МассивОбъектов.Добавить("Справка");
	МассивОбъектов.Добавить("Справочники");
	МассивОбъектов.Добавить("Стили");
	МассивОбъектов.Добавить("ЭлементыСтиля");
	МассивОбъектов.Добавить("Языки");
	МассивОбъектов.Добавить("Константы");
	
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	//ЗаписьJSON.ОткрытьФайл("ИмяФайла",,,ПараметрыЗаписиJSON);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	Для Каждого Элем Из МассивОбъектов Цикл
		//Данные
		Данные = Метаданные[Элем];
		ЗаписьJSON.ЗаписатьИмяСвойства(Элем);
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Попытка
			Для Каждого ПодЭлем Из Данные Цикл
				//Данные = Метаданные.Справочники.Номенклатура;
				ЗаписьJSON.ЗаписатьИмяСвойства(ПодЭлем.Имя);
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				Попытка
					Реквизиты = ПодЭлем.Реквизиты;
				Исключение
					//Сообщить(ОписаниеОшибки());
					ЗаписьJSON.ЗаписатьКонецОбъекта();
					Продолжить;
				КонецПопытки;
				ТабличныеЧасти = ПодЭлем.ТабличныеЧасти;
				
				//ЗаписьJSON.ЗаписатьНачалоОбъекта();
				//Реквизиты
				ЗаписьJSON.ЗаписатьИмяСвойства("Реквизиты"); //ЗаписьJSON.ЗаписатьНачалоМассива();
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				Для Каждого Реквизит Из Реквизиты Цикл
					ЗаписьJSON.ЗаписатьИмяСвойства(Реквизит.Имя);ЗаписьJSON.ЗаписатьЗначение(Строка(Реквизит.Тип));
				КонецЦикла;
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				
				//ТабличныеЧасти
				ЗаписьJSON.ЗаписатьИмяСвойства("ТабличныеЧасти");ЗаписьJSON.ЗаписатьНачалоМассива();
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				Для Каждого ТЧ Из ТабличныеЧасти Цикл
					ЗаписьJSON.ЗаписатьИмяСвойства(ТЧ.Имя);
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
					
					Для Каждого Реквизит Из Реквизиты Цикл
						ЗаписьJSON.ЗаписатьИмяСвойства(Реквизит.Имя);ЗаписьJSON.ЗаписатьЗначение(Строка(Реквизит.Тип));
					КонецЦикла;
					
					ЗаписьJSON.ЗаписатьКонецОбъекта();
				КонецЦикла;
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				ЗаписьJSON.ЗаписатьКонецМассива();
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
			КонецЦикла;
		Исключение
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			Продолжить;
		КонецПопытки;
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	JSON = ЗаписьJSON.Закрыть();
	ЗначениеВФайл(ПутьКФайлу, JSON);
	
КонецПроцедуры

#КонецОбласти
